lvx/base/Tasks/бит_Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>бит_Задача</Name>
			<Addressing>InformationRegister.бит_ИсполнителиЗадач</Addressing>
			<BasedOn>
				<xr:Item>Document.бит_ФормаВводаБюджета</xr:Item>
				<xr:Item>Document.бит_БюджетнаяОперация</xr:Item>
				<xr:Item>Document.бит_КорректировкаБюджета</xr:Item>
				<xr:Item>Document.бит_АктуализацияБюджета</xr:Item>
				<xr:Item>Document.бит_РаспределениеБюджета</xr:Item>
				<xr:Item>Document.бит_УстановкаЗависимыхОборотов</xr:Item>
				<xr:Item>Document.бит_УстановкаКонтрольныхЗначений</xr:Item>
				<xr:Item>Document.бит_КорректировкаКонтрольныхЗначений</xr:Item>
				<xr:Item>Document.бит_ПолучениеФактическихДанных</xr:Item>
				<xr:Item>Document.бит_ОперацияБюджетирование</xr:Item>
				<xr:Item>Catalog.бит_Бюджеты</xr:Item>
				<xr:Item>Catalog.бит_СтатьиОборотов</xr:Item>
				<xr:Item>Catalog.Проекты</xr:Item>
				<xr:Item>Catalog.бит_НастройкиФормВводаБюджета</xr:Item>
				<xr:Item>Catalog.бит_НастройкиРаспределенияБюджета</xr:Item>
				<xr:Item>Catalog.бит_ЭлементыДанных</xr:Item>
				<xr:Item>Catalog.Подразделения</xr:Item>
				<xr:Item>Document.бит_ДополнительныеУсловияПоДоговору</xr:Item>
				<xr:Item>Document.бит_УстановкаНеснижаемыхОстатков</xr:Item>
				<xr:Item>Document.бит_СведенияОбОстаткахДенежныхСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаРасходованиеСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</xr:Item>
				<xr:Item>Catalog.СценарииПланирования</xr:Item>
				<xr:Item>Document.бит_ПротоколРасхожденийБюджета</xr:Item>
				<xr:Item>Document.бит_УстановкаЗначенийПроизвольныхПараметров</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыВажностиЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Comment>Срок исполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКИсполнению</Name>
					<Comment>Дата принятия к исполнению</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИсполнения</Name>
					<Comment>Дата начала исполнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияИсполнения</Name>
					<Comment>Дата окончания исполнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Comment>Результат выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Comment>Предмет</Comment>
					<Type>
						<v8:Type>cfg:TaskRef.бит_Задача</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПредыдущее</Name>
					<Comment>Состояние предыдущее</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОснование</Name>
					<Comment>Задача основание</Comment>
					<Type>
						<v8:Type>cfg:TaskRef.бит_Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПодчиненный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаАлгоритма</Name>
					<Comment>Точка алгоритма</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТочкиАлгоритмов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПроверочнаяЗадача</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Визы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаПроверку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:TaskRef.бит_Задача</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Принято</Name>
							<Comment>Принято</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Comment>Роль исполнителя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОбъектАдресации_1</Name>
					<Comment>Объект адресации № 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОбъектАдресации_2</Name>
					<Comment>Объект адресации № 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОбъектАдресации_3</Name>
					<Comment>Объект адресации № 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

lvx/base/Tasks/бит_Задача/Forms/ФормаПеренаправленияЗадачи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяЗадача = Параметры.ЗадачаОснование;
	Режим         = Параметры.Режим;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяЗадача) Тогда
		
		ТекстСообщения = НСтр("ru = 'Не указана задача для перенаправления.';
						  	  |en = 'Не указана задача для перенаправления.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
	
		СрокИсполнения = ТекущаяЗадача.СрокИсполнения;
		МаксКоличествоОбъектов = бит_УправлениеПроцессами.МаксимальноеКоличествоОбъектовАдресации();
		НастройкиАдресации = Справочники.бит_РолиИсполнителей.НастройкиОбъектовАдресации(РольИсполнителя);	
		
		УстановитьВидимость();
		 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РольИсполнителяПриИзменении(Элемент)
	
	ИзменениеРолиИсполнителя();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособАдресацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАдресации_1Очистка(Элемент, СтандартнаяОбработка)
	
	ОчисткаОбъектаАдресации("ОбъектАдресации_1");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАдресации_2Очистка(Элемент, СтандартнаяОбработка)
	
	ОчисткаОбъектаАдресации("ОбъектАдресации_2");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАдресации_3Очистка(Элемент, СтандартнаяОбработка)
	
	ОчисткаОбъектаАдресации("ОбъектАдресации_3");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПеренаправить(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Если Режим = "ИзСписка" Тогда
			
			ДействиеВыполнено = ПеренаправитьЗадачу();
			Если ДействиеВыполнено Тогда
				ОповеститьОбИзменении(Тип("ЗадачаСсылка.бит_Задача"));
				Закрыть();
			КонецЕсли; 
			
		ИначеЕсли Режим = "ИзФормы" Тогда	
			
			СтруктураПараметров = СформироватьСтруктуруПараметров();
			Закрыть(СтруктураПараметров);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - обработчик события "ОбработкаПроверкиЗаполненияНаСервере" формы.
// 
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособАдресации = 0 Тогда
		
		// Адресация по исполнителю - РольИсполнителя не обязательна.
		Сч = ПроверяемыеРеквизиты.Найти("РольИсполнителя");		
		
		Если ТипЗнч(Сч) = Тип("Число") Тогда		
			ПроверяемыеРеквизиты.Удалить(Сч);		
		КонецЕсли; 
		
	ИначеЕсли СпособАдресации = 1 Тогда	
		
		// Адресация по роли - Исполнитель не обязательный.
		Сч = ПроверяемыеРеквизиты.Найти("Исполнитель");
		
		Если ТипЗнч(Сч) = Тип("Число") Тогда		
			ПроверяемыеРеквизиты.Удалить(Сч);		
		КонецЕсли; 
		
		Для Сч = 1 По МаксКоличествоОбъектов Цикл
		
			ИмяРеквизита = "ОбъектАдресации_"+Сч;
			
			ТекНастройка = Неопределено;
			НастройкиАдресации.Свойство(ИмяРеквизита, ТекНастройка);
			
			Если ТекНастройка <> Неопределено И ТекНастройка.Обязательный Тогда			
				ПроверяемыеРеквизиты.Добавить(ИмяРеквизита);			
			КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

// Функция перенаправляет задачу другому исполнителю.
// 
// Возвращаемое значение:
//  Булево.
// 
&НаСервере
Функция ПеренаправитьЗадачу()

	ДействиеВыполнено = Ложь;
	
	СтруктураПараметров = СформироватьСтруктуруПараметров();
	ДействиеВыполнено = Задачи.бит_Задача.ПеренаправитьЗадачу(СтруктураПараметров, МаксКоличествоОбъектов);

	Возврат ДействиеВыполнено;
	
КонецФункции // ПеренаправитьЗадачу()

// Функция формирует структуру параметров для перенаправления задачи.
// 
// Возвращаемое значение:
//  Структура.
// 
&НаСервере
Функция СформироватьСтруктуруПараметров()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗадачаОснование",ТекущаяЗадача);
	СтруктураПараметров.Вставить("СрокИсполнения" ,СрокИсполнения);
	СтруктураПараметров.Вставить("Комментарий"    ,Комментарий);
	СтруктураПараметров.Вставить("СпособАдресации",СпособАдресации);
	СтруктураПараметров.Вставить("Исполнитель"    ,Исполнитель);
	СтруктураПараметров.Вставить("РольИсполнителя",РольИсполнителя);
	
	Для Индекс = 1 По МаксКоличествоОбъектов Цикл
		ИмяРеквизита = "ОбъектАдресации_"+Индекс;
		СтруктураПараметров.Вставить(ИмяРеквизита, ЭтотОбъект[ИмяРеквизита]);
	КонецЦикла; 
	
	Возврат СтруктураПараметров;
	
КонецФункции // СформироватьСтруктуруПараметров()

// Процедура управляет видимостью элементов формы. 
// 
&НаСервере
Процедура УстановитьВидимость()
	
	флЭтоАдресацияИсполнителю = СпособАдресации = 0;
	флЭтоАдресацияРоли        = СпособАдресации = 1;
	
	Элементы.Исполнитель.Видимость         = флЭтоАдресацияИсполнителю;
	Элементы.ГруппаАдресацияРоли.Видимость = флЭтоАдресацияРоли;
	
	бит_УправлениеПроцессами.НастроитьПоляОбъектовАдресации(Элементы, НастройкиАдресации, МаксКоличествоОбъектов);
	
КонецПроцедуры // УстановитьВидимость()

// Процедура обрабатывает изменение роли исполнителя. 
// 
&НаСервере
Процедура ИзменениеРолиИсполнителя()

	НастройкиАдресации = Справочники.бит_РолиИсполнителей.НастройкиОбъектовАдресации(РольИсполнителя);

	бит_УправлениеПроцессами.НазначитьТипыОбъектовАдресации(ЭтотОбъект, НастройкиАдресации, МаксКоличествоОбъектов);
	
	УстановитьВидимость();

КонецПроцедуры // ИзменениеРолиИсполнителя()

// Процедура осуществляет очистку объекта адресации. 
// 
// Параметры:
//  Имя - Строка.
// 
&НаКлиенте
Процедура ОчисткаОбъектаАдресации(Имя)
	
	ТекНастройка = Неопределено;
	НастройкиАдресации.Свойство(Имя, ТекНастройка);
	
	Если ТекНастройка <> Неопределено Тогда
		ЭтотОбъект[Имя] = ТекНастройка.Тип.ПривестиЗначение(ЭтотОбъект[Имя]);
	Иначе
		ЭтотОбъект[Имя] = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры // ОчисткаОбъектаАдресации()

#КонецОбласти
